app/controllers/appointments_controller.rb

SELECT "appointments".* FROM "appointments" ORDER BY appt_time ASC
---
def index
  	@appointments = Appointment.order('appt_time ASC')

INSERT INTO "appointments" ("title", "appt_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "CEO "], ["appt_time", "2019-02-26 19:00:00"], ["created_at", "2019-02-26 10:12:39.181384"], ["updated_at", "2019-02-26 10:12:39.181384"]]
SELECT "appointments".* FROM "appointments" ORDER BY appt_time ASC
---
def create
  @appointment = Appointment.create(appointment_params)
  @appointments = Appointment.order('appt_time ASC')